AJMartel/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
/*
 * Macro to calculate UBBR from XTAL and baudrate
 */
#if defined(__AVR_ATmega32__) && UART_BAUDRATE_DOUBLE_SPEED
	#define UART_BAUD_SELECT(baudRate,xtalCpu) ((xtalCpu / 4 / baudRate - 1) / 2)
#elif defined(__AVR_ATmega32__)
	#define UART_BAUD_SELECT(baudRate,xtalCpu) ((xtalCpu / 8 / baudRate - 1) / 2)
#elif UART_BAUDRATE_DOUBLE_SPEED
	#define UART_BAUD_SELECT(baudRate,xtalCpu) (((float)(xtalCpu))/(((float)(baudRate))*8.0)-1.0+0.5)
#else
	#define UART_BAUD_SELECT(baudRate,xtalCpu) (((float)(xtalCpu))/(((float)(baudRate))*16.0)-1.0+0.5)
#endif


/*
 * States used in the receive state machine
 */
#define	ST_START		0
#define	ST_GET_SEQ_NUM	1
#define ST_MSG_SIZE_1	2
#define ST_MSG_SIZE_2	3
#define ST_GET_TOKEN	4
#define ST_GET_DATA		5
#define	ST_GET_CHECK	6
#define	ST_PROCESS		7

/*
 * use 16bit address variable for ATmegas with <= 64K flash
 */
#if defined(RAMPZ)
	typedef uint32_t address_t;
#else
	typedef uint16_t address_t;
#endif

/*
 * function prototypes
 */
static void sendchar(char c);


// SDCARD BOOTLOADER


FATFS Fatfs;				/* Petit-FatFs work area */
unsigned char Buff[SPM_PAGESIZE];	/* Page data buffer */

// SDCARD BOOTLOADER



/*
 * since this bootloader is not linked against the avr-gcc crt1 functions,
 * to reduce the code size, we need to provide our own initialization
 */
void __jumpMain	(void) __attribute__ ((naked)) __attribute__ ((section (".init9")));
#include <avr/sfr_defs.h>

//#define	SPH_REG	0x3E
//#define	SPL_REG	0x3D

//*****************************************************************************
void __jumpMain(void)
{
//*	July 17, 2010	<MLS> Added stack pointer initialzation
//*	the first line did not do the job on the ATmega128

	asm volatile ( ".set __stack, %0" :: "i" (RAMEND) );

//*	set stack pointer to top of RAM

	asm volatile ( "ldi	16, %0" :: "i" (RAMEND >> 8) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_HI_ADDR) );

	asm volatile ( "ldi	16, %0" :: "i" (RAMEND & 0x0ff) );
	asm volatile ( "out %0,16" :: "i" (AVR_STACK_POINTER_LO_ADDR) );

	asm volatile ( "clr __zero_reg__" );									// GCC depends on register r1 set to 0
	asm volatile ( "out %0, __zero_reg__" :: "I" (_SFR_IO_ADDR(SREG)) );	// set SREG to 0
	asm volatile ( "jmp main");												// jump to main()
}


//*****************************************************************************
void delay_ms(unsigned int timedelay)
{
	unsigned int i;
	for (i=0;i<timedelay;i++)
	{
		_delay_ms(0.5);
	}
}


//*****************************************************************************
/*
 * send single byte to USART, wait until transmission is completed
 */
static void sendchar(char c)
{
	UART_DATA_REG	=	c;										// prepare transmission
	while (!(UART_STATUS_REG & (1 << UART_TRANSMIT_COMPLETE)));	// wait until byte sent
	UART_STATUS_REG |= (1 << UART_TRANSMIT_COMPLETE);			// delete TXCflag
}


//************************************************************************
static int	Serial_Available(void)
{
	return(UART_STATUS_REG & (1 << UART_RECEIVE_COMPLETE));	// wait for data
}




#define	MAX_TIME_COUNT	(F_CPU >> 1)
//*****************************************************************************
static unsigned char recchar_timeout(void)
{
uint32_t count = 0;

	while (!(UART_STATUS_REG & (1 << UART_RECEIVE_COMPLETE)))
	{
		// wait for data
		count++;
		if (count > MAX_TIME_COUNT)
		{
		unsigned int	data;
		#if (FLASHEND > 0x10000)
			data	=	pgm_read_word_far(0);	//*	get the first word of the user program
		#else
			data	=	pgm_read_word_near(0);	//*	get the first word of the user program
		#endif
			if (data != 0xffff)					//*	make sure its valid before jumping to it.
			{
				asm volatile(
						"clr	r30		\n\t"
						"clr	r31		\n\t"
						"ijmp	\n\t"
						);
			}
			count	=	0;
		}
	}
	return UART_DATA_REG;
}

//*	for watch dog timer startup
void (*app_start)(void) = 0;
uint8_t check = 1;


unsigned int crc16file(DWORD fs) {
  unsigned int crc_value = 0x0000; //if not self.mdflag else 0xffff
  unsigned long tmp = 0;
  unsigned long rotated = 0, count = 0;
  unsigned short crc = 0;
	WORD br;	/* Bytes read */
	DWORD rm=fs; /*bytes remianing*/
	uint16_t scan;
  int var = 0;
  char d = 0;
	int status=0;
	LiquidCrystalsetCursor(0,2);

	for (count = 0; count < 0x3E000; count += SPM_PAGESIZE) {	/* Update all application pages */

		//delay_ms(50);

		memset(Buff, 0x00, SPM_PAGESIZE);
			pf_read(Buff, SPM_PAGESIZE, &br,&rm);	/* Load a page data */
			if (rm > SPM_PAGESIZE){
				scan = SPM_PAGESIZE;
			}
			else {
				scan = rm;
				//sendchar('D');
				//sendchar('V');
				//sendchar(scan>>8);
				//sendchar(scan&0x00FF);
				//LCDwrite('D');
			}
			if (!br){
				//LCDwrite('E');
				break;
			}

			for (int i=0;i<scan;i++){
				//sendchar(scan-i);
				d=Buff[i];
				tmp = crc_value ^ d;
				rotated = crc_value >> 8;
				crc = tmp & 0x00ff;

				for (int j = 0; j < 8; j++) {
					if (crc & 0x0001) {
						crc = (crc >> 1) ^ 0xA001;
					}
					else  crc >>= 1;
				}

				crc_value = rotated ^ crc;
				//sendchar(crc_value>>8);
				//sendchar(crc_value&0x00FF);
			}

			//sendchar(rm/SPM_PAGESIZE);
			displayStatus(fs,rm);

	 }
	 //sendchar('E');
	 //sendchar('V');
	 //sendchar(crc_value>>8);
	 //sendchar(crc_value&0x00FF);
  return crc_value;

}

BYTE ascii_to_nibble(char c) {
  if (c >= '0' && c <= '9') {
    return (BYTE) (c - '0');
  }
  else if (c >= 'A' && c <= 'F') {
    return (BYTE) (c - 'A' + 10);
  }
  else {
    return (BYTE) (c - 'a' + 10);
  }
}

void displayStatus(DWORD fs,DWORD rm){
	static DWORD current = 0;
	DWORD fivePercent = fs/21;

	if ((fs-rm)<fivePercent){
		current = fivePercent;
	}
	//if (rm<fivePercent){
		//current = fs-fivePercent;
	//}
	if ((fs-rm)>current){
		LCDwrite(219);
		if (rm>fivePercent){
			current = current + fivePercent;
		}
		else{
			current=fs;
		}
	}
}

//*****************************************************************************
int main(void)
{
	address_t		address			=	0;
	address_t		eraseAddress	=	0;
	unsigned char	msgParseState;
	unsigned int	ii				=	0;
	unsigned char	checksum		=	0;
	unsigned char	seqNum			=	0;
	unsigned int	msgLength		=	0;
	unsigned char	msgBuffer[285];
	unsigned char	c, *p;
	unsigned char   isLeave = 0;

