AJMartel/MicroBridge-Arduino-ATMega2560/hardware/microbridge/bootloaders/microbridge/stk500boot.c
				case CMD_READ_FLASH_ISP:
				case CMD_READ_EEPROM_ISP:
					{
						unsigned int	size	=	((msgBuffer[1])<<8) | msgBuffer[2];
						unsigned char	*p		=	msgBuffer+1;
						msgLength				=	size+3;

						*p++	=	STATUS_CMD_OK;
						if (msgBuffer[0] == CMD_READ_FLASH_ISP )
						{
							unsigned int data;

							// Read FLASH
							do {
						//#if defined(RAMPZ)
						#if (FLASHEND > 0x10000)
								data	=	pgm_read_word_far(address);
						#else
								data	=	pgm_read_word_near(address);
						#endif
								*p++	=	(unsigned char)data;		//LSB
								*p++	=	(unsigned char)(data >> 8);	//MSB
								address	+=	2;							// Select next word in memory
								size	-=	2;
							}while (size);
						}
						else
						{
							/* Read EEPROM */
							do {
								EEARL	=	address;			// Setup EEPROM address
								EEARH	=	((address >> 8));
								address++;					// Select next EEPROM byte
								EECR	|=	(1<<EERE);			// Read EEPROM
								*p++	=	EEDR;				// Send EEPROM data
								size--;
							} while (size);
						}
						*p++	=	STATUS_CMD_OK;
					}
					break;

				default:
					msgLength		=	2;
					msgBuffer[1]	=	STATUS_CMD_FAILED;
					break;
			}

			/*
			 * Now send answer message back
			 */
			sendchar(MESSAGE_START);
			checksum	=	MESSAGE_START^0;

			sendchar(seqNum);
			checksum	^=	seqNum;

			c			=	((msgLength>>8)&0xFF);
			sendchar(c);
			checksum	^=	c;

			c			=	msgLength&0x00FF;
			sendchar(c);
			checksum ^= c;

			sendchar(TOKEN);
			checksum ^= TOKEN;

			p	=	msgBuffer;
			while ( msgLength )
			{
				c	=	*p++;
				sendchar(c);
				checksum ^=c;
				msgLength--;
			}
			sendchar(checksum);
			seqNum++;

		#ifndef REMOVE_BOOTLOADER_LED
			//*	<MLS>	toggle the LED
			PROGLED_PORT	^=	(1<<PROGLED_PIN);	// active high LED ON
		#endif

		}
	}

    if(boot_state == 2){
			LiquidCrystalclear();
			LCDprint("SD",2);

delay_ms(2000);

    	sendchar('A');
			DDRA = DDRA | 2; //switch on power pin to sd card
			PORTA = PORTA | 2;
			delay_ms(50);

			sendchar(pf_mount(&Fatfs));	/* Initialize file system */
			delay_ms(50);
			/*
        if(eeprom_read_byte(0xFFF) == 0xF0){
        	DDRB = DDRB & 0x0F;
        	PORTB = PORTB & 0xF0;
				}*/
				DWORD rmrcr; /*bytes remianing*/
				if (pf_open("ACT.GO",&rmrcr)==FR_OK){
					LiquidCrystalclear();
					LCDprint("SD Boot",7);

delay_ms(2000);
        	sendchar('B');
         	WORD brcrc;	/* Bytes read */
					memset(Buff, 0xFF, 5);
					pf_read(Buff, 5, &brcrc,&rmrcr);	/* Load a page data */
					uint8_t test=0;
					for (int crcCalcLoop=0;crcCalcLoop<5;crcCalcLoop++){
						if (Buff[crcCalcLoop]==0xFF){
							test=1;
							LiquidCrystalsetCursor(0,1);
							LCDprint("Bad Data",8);
							delay_ms(2000);
						}
					}
					if (!test){
	          unsigned int datacrc = (ascii_to_nibble(Buff[0]) * 10000) + (ascii_to_nibble(Buff[1]) * 1000) + (ascii_to_nibble(Buff[2]) * 100) + (ascii_to_nibble(Buff[3]) * 10) + ascii_to_nibble(Buff[4]);
							sendchar('D');
						 	DWORD filesize;
							int pfstatus=pf_open("ACT.BIN",&filesize);

	            sendchar(pfstatus);

	           if( pfstatus== FR_OK){
							 LiquidCrystalsetCursor(0,1);
							 LCDprint("Checking File",13);
	           	   sendchar('C');
								 uint16_t filecrc=crc16file(filesize);
								 if (filecrc==datacrc){

									 LiquidCrystalclear();
				 					 LCDprint("SD Boot",7);
									 LiquidCrystalsetCursor(0,1);
									 LCDprint("File OK Flashing",16);
									 LiquidCrystalsetCursor(0,2);


									 pf_lseek(0);
									 sendchar('D');
		               DWORD fa;	/* Flash address */
		               WORD br;	/* Bytes read */
							 		 DWORD rm; /*bytes remianing*/
		               uint8_t i = 0;

		               sendchar(0x0d);
		               sendchar(0x0a);
		               for (fa = 0; fa < 0x3E000; fa += SPM_PAGESIZE) {	/* Update all application pages */
		                   PROGLED_PORT	^=	(1<<PROGLED_PIN);	// turn LED ON
		                   delay_ms(50);
		                   flash_erase(fa);					/* Erase a page */
		                   memset(Buff, 0xFF, SPM_PAGESIZE);	/* Clear buffer */
		                   pf_read(Buff, SPM_PAGESIZE, &br,&rm);	/* Load a page data */
		                   if(br) flash_write(fa, Buff);		/* Write it if the data is available */
											 displayStatus(0x3E000,(0x3E000-fa));
		                }
		               sendchar(0x0d);
		               sendchar(0x0a);
		               check = 0;

	               //eeprom_write_byte (0xFFF, 0xFF);
							 }
							 else{
								 LiquidCrystalclear();
								 LCDprint("Bad CRC",7);
								 delay_ms(2000);
							 }
					 	}
						else{
							LiquidCrystalsetCursor(0,1);
							LCDprint("No Firmware File",16);
							delay_ms(2000);
						}
           }
        }
				else{
					LiquidCrystalsetCursor(0,1);
					LCDprint("No Other File",13);
					delay_ms(2000);
				}
    }


	asm volatile ("nop");			// wait until port has changed




//    // SDCARD BOOTLOADER
//
//    WORD fa;	/* Flash address */
//    WORD br;	/* Bytes read */
//	uint8_t i = 0;
//
//
//	pf_mount(&Fatfs);	/* Initialize file system */
//
//
//	if (pf_open("app.bin") == FR_OK) {	/* Open application file */
//        PROGLED_PORT	|=	(1<<PROGLED_PIN);	// turn LED on
//
//        for (fa = 0; fa < 0x1000; fa += SPM_PAGESIZE) {	/* Update all application pages */
//            memset(Buff, 0xFF, SPM_PAGESIZE);		/* Clear buffer */
//            pf_read(Buff, SPM_PAGESIZE, &br);		/* Load a page data */
//
//			if (br) {					/* Bytes Read > 0? */
//            	for (i = br; i < SPM_PAGESIZE; i++)     /* Pad the remaining last page with 0xFF so that comparison goes OK */
//                    Buff[i] = 0xFF;
//                if (pagecmp(fa, Buff)) {
//                    flash_erase(fa);		/* Erase a page */
//                    flash_write(fa, Buff);		/* Write it if the data is available */
//                }
//            }
//    	}
//        PROGLED_PORT	&=	~(1<<PROGLED_PIN);	// turn LED off
//
//    }
//
//    if (pgm_read_word(0) != 0xFFFF)		/* Start application if exist */
//        asm volatile("jmp 0000");
//    // SD CARD BOOTLOADER


